import React from 'react'

export default function Skills() {
  return (
    <div className='container'>
           <h1 className="about">
           мои <span>skills</span>
        </h1>
        <div className='all_skill'>
            <div data-aos="zoom-in" className='skil'>
                <h3>Hard skills</h3>
                <ul><li>API: <span>Опыт разработки и интеграции RESTful и GraphQL API</span></li></ul>
                <ul><li>SEO: <span>Знание принципов поисковой оптимизации (SEO) для улучшения видимости веб-страниц</span></li></ul>
                <ul><li>Next.js: <span>Опыт работы с фреймворком Next.js для создания серверных и клиентских приложений</span></li></ul>
                <ul> <li>Redux Toolkit: <span>Использование Redux Toolkit для управления состоянием в React приложениях</span></li></ul>
                <ul><li>JavaScript:  <span>для создания интерактивных веб-приложений  Фреймворки: Знание и опыт работы с фреймворками</span></li></ul>
                <ul><li>Front-End:  <span>такими как React, Angular или Vue.js Responsive Design: Умение создавать адаптивные веб-сайты, которые хорошо выглядят на различных устройствах и экранах</span></li></ul>
                <ul><li>Версионный контроль:  <span>Опыт работы с системами контроля версий, такими как Git, для управления кодом и совместной работы над проектами</span></li></ul>
                <ul><li>Инструменты разработчика:  <span>Знание инструментов разработчика  в браузере для отладки и анализа производительности веб-страниц</span></li></ul>
            </div>
            <div data-aos="zoom-in" className='skil'>
                <h3>Soft skills</h3>
                <ul><li>Коммуникация:  <span>Эффективное взаимодействие с членами команды и заказчиками для понимания требований и достижения общих целей проекта</span></li></ul>
                <ul><li>Креативность:  <span>Нахождение инновационных и качественных решений в процессе разработки</span></li></ul>
                <ul><li>Проблемное мышление:  <span>Анализ проблем и поиск оптимальных решений с использованием логического и аналитического мышления</span></li></ul>
                <ul><li>Управление временем:  <span>Эффективное распределение времени и ресурсов для выполнения задач в срок</span></li></ul>
                <ul><li>Коллаборация:  <span> Готовность работать в команде, обмениваться знаниями и опытом для достижения общих целей проекта</span></li></ul>
                <ul><li> Адаптивность:  <span>Гибкость и способность адаптироваться к изменениям в требованиях проекта или рабочей среде</span></li></ul>
                <ul><li>Стрессоустойчивость:  <span>Способность эффективно работать в условиях высокой нагрузки и управлять стрессом.</span></li></ul>
            </div>
        </div>
    </div>
  )
}
